{
  "profile": {
    "name": "Pawan Danani",
    "links": [
      {
        "name": "GitHub",
        "url": "https://github.com/pdanani"
      },
      {
        "name": "LinkedIn",
        "url": "https://www.linkedin.com/in/pawan-danani-8b9402148/"
      },
      {
        "name": "nycpawan@gmail.com",
        "url": "nycpawan@gmail.com"
      }
    ]
  },
  "projects": [
    {
      "title": "Marvin's Studio",
      "description": "Playlist Maker and Music Player, allowing users to share, fork, and collaborate on playlists with friends. Genre of the Week promotes new songs for users to try out.",
      "githubURL": "https://github.com/pdanani/Marvins-Studio"
    },
    {
      "title": "Gesture Swiping Decoder",
      "description": "Decoding Gesture Swiping using the SHARK2 Algorithm and implemented using numpy. This program goes through multiple stages of pruning using location, shape letter based channels in order to reduce possibilities to a 'best possible word'",
      "githubURL": "https://github.com/pdanani/Gesture-Typing-Decoder"
    },
    {
      "title": "Synchronization Free Memory Allocator",
      "description": "A custom dynamic memory allocator designed for x86-64 architecture, which serves as a replacement for the standard malloc, free, and realloc functions typically supplied by glibc. Key features include the utilization of segregated free lists, which enables a 'first-best fit' block placement strategy, and an immediate colasescing algorithm to minimize external fragmentation.",
      "githubURL": "https://github.com/pdanani/MemoryAllocator"
    },
    {
      "title": "SongOff",
      "description": "A song exploration app that allows users to vote on one of 4 daily picks to count toward the Song of the Day. Votes reset every 24 hours and the winner is stored in the database",
      "githubURL": "https://github.com/pdanani/songoff"
    },
    {
      "title": "DNS Dig Tool",
      "description": "The resolver takes as input a domain name. Using a recursive algorithm the tool resolves this query by first contacting the root server, the top-level domain, all the way until the authoritative name server.",
      "githubURL": "https://github.com/pdanani/DNSDigTool"
    },
    {
      "title": "GoLogoLo",
      "description": "Developed a logo creator using the MERN stack and includes functionality to create shapes, text, image importing and gradient coloring. Application includes an option to export your logo as a .png file for web usage.",
      "githubURL": "https://github.com/pdanani/GoLogoLo-MERN-"
    }
  ],
  "experience": [
    {
      "jobTitle": "Software Developer",
      "company": "Park Beauty",
      "description": "Design and develop a solution to integrate e-commerce platform data with the goal to reduce margin of error and increase employee efficiency",
      "startDate": "2023-02-12",
      "tech": "JavaScript React, PostgreSQL, GraphQL, and Apollo"
    },
    {
      "jobTitle": "Software Developer",
      "company": "Madeyn",
      "description": "Full-Stack Developer for Madeyn.com, a platform aiming to make wholesale more social. I created several pages from scratch including the Profile, Explore, and Details page.",
      "startDate": "2022-03-01",
      "endDate": "2022-10-01",
      "tech": "brief summary of job"
    },
    {
      "jobTitle": "Software Engineer Intern",
      "company": "PK INTL",
      "description": "I had the chance to help a small company with an inventory offering system. I used Mongoose and GraphQL a feature to send offers on items with specific quantities by creating an offer model and then developing the Front End using React.",
      "startDate": "2021-09-30",
      "endDate": "2022-01-02",
      "tech": "Mongoose, Express, React, Node, GraphQL"
    }
  ]
}